{
"About": {
  "Name": "Fletcher Green",
  "Currently": "Computer Science Student",
  "Headshot": "portfolio-headshotimg.jpg",
  "Thumbnail": "portfolio-headshotimg.jpg",
  "AboutText": "I am a fourth-year student at Seattle Pacific University studying computer science. I chose to pursue computer science because I enjoy learning and problem solving. During my time at Seattle Pacific, I have studied multiple programming languages and applied them to unique problems. Outside of classes, I enjoy combining my programming skills with my other passions, like music. I am seeking an internship or entry level job related to software development after I graduate this coming Summer. Please reach out to me if you are interested in my skills or have any opportunities."
},
"Contact": {
  "EMail": "greenf@spu.edu",
  "Phone": "(253) 981-2318",
  "Portfolio": "https://fcgreen6.github.io/",
  "LinkedIn": "https://www.linkedin.com/in/fletcherg-tech/",
  "GitHub": "https://www.github.com/fcgreen6/"
},
"Experience": {
  "ExperienceText": "Through my education at Seattle Pacific University, I have gained the essential foundational experience necessary to thrive in computer science related professions. I have also developed essential communication skills and a sense of responsibility through work outside of college.",
  "School": "Seattle Pacific University",
  "Major": "Major: Computer Science",
  "Graduation": "Minor: Mathematics",
  "EducationText": "Expected Graduation: June 2026",
  "Employment": "Seattle Pacific University",
  "Role": "Computer Grading Assistant",
  "EmploymentText": "Wrote Bash scripts to automate the grading of computer science projects. Resolved conflict with students when issues arised. ",
  "Skills": ["C++", " HTML", " JavaScript", " CSS", " Go", " Calculus", " Linear Algebra", " WSL"],
  "SkillsText": "These skills were developed through a combination of completing classwork and self study.",
  "Resume": "portfolio-resume.pdf"  
},
"Project1": {
    "Title": "C++ Certified Associate Programmer",
    "Desc": "I completed the C++ Associate Programmer Certification. I was motivated to work toward this certification because I had prior experience using C++ in my classes and I wanted to understand the language deeper.",
    "GitHubRepo": "",
    "MainImage": "portfolio-certimg.png",
    "DetailImages": ""
  },
  "Project2": {
    "Title": "Roguelike Deckbuilding Game",
    "Desc": "Proposed a unique variation on the roguelike deckbuilding genre. Selected the Agile Scrum design methodology to structure ongoing team project development. ",
    "GitHubRepo": "",
    "MainImage": "portfolio-deckimg.png",
    "DetailImages": ""
  },
  "Project3": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
